[
    "If laughter is the best medicine, your face must be curing the world.",
    "You're so ugly, you scared the crap out of the toilet.",
    "Your family tree must be a cactus because everybody on it is a prick.",
    "No I'm not insulting you, I'm describing you.",
    "It's better to let someone think you are an Idiot than to open your mouth and prove it.",
    "If I had a face like yours, I'd sue my parents.",
    "Your birth certificate is an apology letter from the condom factory.",
    "I guess you prove that even god makes mistakes sometimes.",
    "The only way you'll ever get laid is if you crawl up a chicken's ass and wait.",
    "You're so fake, Barbie is jealous.",
    "I’m jealous of people that don’t know you!",
    "You're so ugly, when your mom dropped you off at school she got a fine for littering.",
    "If I wanted to kill myself I'd climb your ego and jump to your IQ.", 
    "You must have been born on a highway because that's where most accidents happen.",
    "Brains aren't everything. In your case they're nothing.",
    "I don't know what makes you so stupid, but it really works.",
    "I can explain it to you, but I can’t understand it for you.",
    "Calling you an idiot would be an insult to all the stupid people.",
    "You, sir, are an oxygen thief!",
    "Some babies were dropped on their heads but you were clearly thrown at a wall.",
    "Why don't you go play in traffic",
"I'd slap you, but that would be animal abuse.",
"They say opposites attract. I hope you meet someone who is good-looking, intelligent, and cultured.",
"Stop trying to be a smart ass, you're just an ass.",
"You have Diarrhea of the mouth; constipation of the ideas.",
"If ugly were a crime, you'd get a life sentence.",
"Your mind is on vacation but your mouth is working overtime.",
"Why don't you slip into something more comfortable... like a coma.",
"Shock me, say something intelligent.",
"If your gonna be two faced, honey at least make one of them pretty.",
"Keep rolling your eyes, perhaps you'll find a brain back there.",
"There is no vaccine against stupidity.",
"You're the reason the gene pool needs a lifeguard.",
"How old are you? - Wait I shouldn't ask, you can't count that high",
"Have you been shopping lately? They're selling lives, you should go get one.",
"You're like Monday mornings, nobody likes you",
"Of course I talk like an idiot, how else would you understand me?",
"You're so fat, you could sell shade.",
"Don't you need a license to be that ugly?",
"So, a thought crossed your mind? Must have been a long and lonely journey.",
"You're so dumb that you got hit by a parked car.",
"Keep talking, someday you'll say something intelligent!",
"How did you get here? Did someone leave your cage open?",
"Wipe your mouth, there's still a tiny bit of bullshit around your lips.",
"Don't you have a terribly empty feeling - in your skull?",
"As an outsider, what do you think of the human race?",
"Are you always this stupid or is today a special occasion?",
"Your mother should have thrown you away and kept the stork.",
"I never forget a face, but in your case, I'll make an exception.",
"Some cause happiness wherever they go, others whenever they go.",
"Only two things are infinite-- the universe and human stupidity, and I'm not so sure about the former.",
"If you won't be a good example, then you'll have to be a horrible warning."
]